In [1]:
import pandas as pd
list_of_dict = [{"name" : "Gaurav" , "rollno" : 's1' , "salary" : 1000 , "dept" : "comp"},
        {"name" : "Pratik" , "rollno" : 's2' , "salary" : 700,"dept" : "IT"},
        {"name" : "Sneha" , "rollno" : 's3' , "salary" : 600,"dept" : "comp"},
       {"name" : "Mayur" , "rollno" : 's4' , "salary" : 500,"dept" : "Mech"}
      
       ]

df = pd.DataFrame(list_of_dict) 

df

     name rollno  salary  dept
0  Gaurav     s1    1000  comp
1  Pratik     s2     700    IT
2   Sneha     s3     600  comp
3   Mayur     s4     500  Mech

In [11]:
#  column projection
df["name"]

0    Gaurav
1    Pratik
2     Sneha
3     Mayur
Name: name, dtype: object

In [161]:
df[["name","salary"]]

     name  salary
0  Gaurav    1000
1  Pratik     700
2   Sneha     600
3   Mayur     500

In [162]:
# # row selection using index labels 
df.iloc[1]

name      Pratik
rollno        s2
salary       700
dept          IT
Name: 1, dtype: object

In [163]:
df.iloc[[0,1]]

     name rollno  salary  dept
0  Gaurav     s1    1000  comp
1  Pratik     s2     700    IT

In [164]:

df

     name rollno  salary  dept
0  Gaurav     s1    1000  comp
1  Pratik     s2     700    IT
2   Sneha     s3     600  comp
3   Mayur     s4     500  Mech

In [165]:
df = df.set_index('rollno')
df.index

Index(['s1', 's2', 's3', 's4'], dtype='object', name='rollno')

In [166]:
df.loc[['s1','s2']]

          name  salary  dept
rollno
s1      Gaurav    1000  comp
s2      Pratik     700    IT

In [167]:
df.loc['s1':'s3']

          name  salary  dept
rollno
s1      Gaurav    1000  comp
s2      Pratik     700    IT
s3       Sneha     600  comp

In [14]:
# row selection using a filter / where clause / filtering the dataset
boolean_list = df['salary'] >599 # [True,True,True,False]
# df.loc[boolean_list]
df[boolean_list]

     name rollno  salary  dept
0  Gaurav     s1    1000  comp
1  Pratik     s2     700    IT
2   Sneha     s3     600  comp

In [17]:
df.query('salary>999')

     name rollno  salary  dept
0  Gaurav     s1    1000  comp

In [170]:
df.query('salary>599')["salary"]

rollno
s1    1000
s2     700
s3     600
Name: salary, dtype: int64

In [171]:
# row selection using a filter / where clause / filtering the dataset
boolean_list = df['salary'] >599 # [True,True,True,False]
df[boolean_list]["name"]

rollno
s1    Gaurav
s2    Pratik
s3     Sneha
Name: name, dtype: object

In [172]:
# row selection using a filter / where clause / filtering the dataset 
# and also column projection 
df.loc[df['salary'] >599,"name"]

rollno
s1    Gaurav
s2    Pratik
s3     Sneha
Name: name, dtype: object

In [173]:

df

# df["salary"]*.10+df["salary"]

          name  salary  dept
rollno
s1      Gaurav    1000  comp
s2      Pratik     700    IT
s3       Sneha     600  comp
s4       Mayur     500  Mech

In [18]:
boolean_list = df['dept'].isin(["comp","IT","Mech"])
df.loc[boolean_list,'name']

0    Gaurav
1    Pratik
2     Sneha
3     Mayur
Name: name, dtype: object

In [175]:
df.query('dept in ("comp","IT")')['name']

rollno
s1    Gaurav
s2    Pratik
s3     Sneha
Name: name, dtype: object

In [176]:
df['salary'] = df['salary']*.10 + df['salary']
# def incr(val):
#     return val+val*0.1

# df["salary"] = df["salary"].apply(incr)

df

          name  salary  dept
rollno
s1      Gaurav  1100.0  comp
s2      Pratik   770.0    IT
s3       Sneha   660.0  comp
s4       Mayur   550.0  Mech

In [177]:
# column processing with axis = == 0 
# # normal python code
# pylist=[[1,2,3],[4,5,6],[7,8,9]]

# col1_sum = 0 
# col2_sum = 0 
# col3_sum = 0 

# for val in pylist:
#     col1_sum+=val[0]
#     col2_sum+=val[1]
#     col3_sum+=val[2]

# col1_sum,col2_sum,col3_sum    

# # numpy code
# import numpy as np
# numpy_array= np.arange(1,10).reshape(3,3)
# numpy_array.sum(axis=0)

# # pandas approach
# import pandas as pd
# df = pd.DataFrame(numpy_array)

# def my_sum(list_of_values):
#     sum = 0 
#     for val in list_of_values:
#         sum+=val
#     return sum  
# df.apply(my_sum,axis = 0)

In [178]:
# # row processing with axis = == 1
# # # normal python code
# pylist=[[1,2,3],[4,5,6],[7,8,9]]

# for row in pylist:
#     row_sum = 0 
#     for val in row:
#         row_sum+=val
#     print(row_sum    )

# # numpy code
# import numpy as np
# numpy_array= np.arange(1,10).reshape(3,3)
# numpy_array.sum(axis=1)

# # pandas approach
# import pandas as pd
# df = pd.DataFrame(numpy_array)

# def my_sum(list_of_values):
#     sum = 0 
#     for val in list_of_values:
#         sum+=val
#     return sum  
# df.apply(my_sum,axis = 1)

In [179]:
df

          name  salary  dept
rollno
s1      Gaurav  1100.0  comp
s2      Pratik   770.0    IT
s3       Sneha   660.0  comp
s4       Mayur   550.0  Mech

In [181]:

def get_category(row):
    if  row['salary']> 999 :
        return "Overpaid"
    else:
        return "Underpaid" 
        
df['new_category'] = df.apply(get_category, axis = 1 )

df

          name  salary  dept new_category
rollno
s1      Gaurav  1100.0  comp     Overpaid
s2      Pratik   770.0    IT    Underpaid
s3       Sneha   660.0  comp    Underpaid
s4       Mayur   550.0  Mech    Underpaid

In [185]:
import re 
def get_sum(column):
        if column.dtype == type(1.1):
            sum = 0.0 
        else:   
            sum = ''
             
        for i in column.array:
            sum+=i
        return sum

# get_sum(pd.Series([1,2,3]))

df.apply(get_sum,axis = 0 )

name                         GauravPratikSnehaMayur
salary                                       3080.0
dept                                 compITcompMech
new_category    OverpaidUnderpaidUnderpaidUnderpaid
dtype: object